## Plans :heavy_multiplication_x:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/502b8f95-2e45-4942-b19f-201dd50c57be).


Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>
<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: oidc
**Success**: :thumbsup:
```
{}
```
</details>

## Dir: . | :heavy_multiplication_x:
**Dir**: .
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: update-terrateam-github-token
**Success**: :thumbsup:
```

```
**Step**: init
**Success**: :thumbsup:
```
Initializing the backend...
Initializing provider plugins...
- Reusing previous version of ariga/atlas from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Using previously-installed ariga/atlas v0.4.7
- Using previously-installed hashicorp/aws v5.95.0

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :heavy_multiplication_x:
```
╷
│ Error: Atlas Plan Error
│ 
│   with atlas_schema.terrateam,
│   on main.tf line 101, in resource "atlas_schema" "terrateam":
│  101: resource "atlas_schema" "terrateam" {
│ 
│ Unable to generate migration plan, got error: Error: mysql: query system
│ variables: dial tcp 172.31.16.13:3306: connect: connection timed out
│ 
╵

data.aws_vpc.default: Reading...
data.aws_vpc.default: Read complete after 1s [id=vpc-08a34afc4a7a1512c]
data.aws_subnets.default: Reading...
data.aws_subnets.default: Read complete after 0s [id=eu-west-1]
aws_db_subnet_group.terrateam: Refreshing state... [id=terrateam]
aws_db_instance.terrateam: Refreshing state... [id=db-LR7LJCHLNZKJS2BC6AGAQSZRAE]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.atlas_schema.terrateam will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "atlas_schema" "terrateam" {
+       dev_db_url = (sensitive value)
+       hcl        = (known after apply)
+       id         = (known after apply)
+       src        = <<-EOT
            # CREATE TABLE users (
            #     id UUID PRIMARY KEY,
            #     created_at TIMESTAMP NOT NULL,
            #     updated_at TIMESTAMP NOT NULL,
            #     name TEXT NOT NULL
            # );
            
            schema "terrateam" {}
            
            table "users" {
              constraint "users" {
                primary_key = true
                columns     = ["id"]
                type        = "uuid"
              }
              constraint "created_at" {
                columns     = ["created_at"]
                type        = "timestamp"
                not_null    = true
              }
              constraint "updated_at" {
                columns     = ["updated_at"]
                type        = "timestamp"
                not_null    = true
              }
              constraint "name" {
                columns     = ["name"]
                type        = "text"
                not_null    = true
              }
            }
        EOT
    }

  # aws_db_instance.terrateam will be updated in-place
!   resource "aws_db_instance" "terrateam" {
        id                                    = "db-LR7LJCHLNZKJS2BC6AGAQSZRAE"
        tags                                  = {}
!       vpc_security_group_ids                = [
-           "sg-0b348aa4ec601f99f",
        ] -> (known after apply)
        # (71 unchanged attributes hidden)
    }

  # aws_security_group.rds will be created
+   resource "aws_security_group" "rds" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               from_port        = 3306
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 3306
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = "terrateam"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = "vpc-08a34afc4a7a1512c"
    }

Plan: 1 to add, 1 to change, 0 to destroy.
╷
│ Warning: dev_url is unset
│ 
│   with atlas_schema.terrateam,
│   on main.tf line 101, in resource "atlas_schema" "terrateam":
│  101: resource "atlas_schema" "terrateam" {
│ 
│ It is highly recommended that you use 'dev_url' to specify a dev database.
│ to learn more about it, visit: https://atlasgo.io/dev-database
╵
Failure during /github/home/.tenv/Terraform/1.11.4/terraform call : exited with code 1

```

</details>

## Cost Estimation
**Total Monthly Difference: 14.41 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 14.41 | 14.41|
| | **Total** | **0.00** | **14.41** | **14.41** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
